zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp255cxx_cm0.h
/*****************  Bit definition for GPIO_HWCFGR7 register  *****************/
#define GPIO_HWCFGR7_AF_PRIO0_Pos      (0U)
#define GPIO_HWCFGR7_AF_PRIO0_Msk      (0xFUL << GPIO_HWCFGR7_AF_PRIO0_Pos)      /*!< 0x0000000F */
#define GPIO_HWCFGR7_AF_PRIO0          GPIO_HWCFGR7_AF_PRIO0_Msk                /*!< Indicate the priority AF for I/O0 (0 to F) */
#define GPIO_HWCFGR7_AF_PRIO1_Pos      (4U)
#define GPIO_HWCFGR7_AF_PRIO1_Msk      (0xFUL << GPIO_HWCFGR7_AF_PRIO1_Pos)      /*!< 0x000000F0 */
#define GPIO_HWCFGR7_AF_PRIO1          GPIO_HWCFGR7_AF_PRIO1_Msk                /*!< Indicate the priority AF for I/O1 (0 to F) */
#define GPIO_HWCFGR7_AF_PRIO2_Pos      (8U)
#define GPIO_HWCFGR7_AF_PRIO2_Msk      (0xFUL << GPIO_HWCFGR7_AF_PRIO2_Pos)      /*!< 0x00000F00 */
#define GPIO_HWCFGR7_AF_PRIO2          GPIO_HWCFGR7_AF_PRIO2_Msk                /*!< Indicate the priority AF for I/O2 (0 to F) */
#define GPIO_HWCFGR7_AF_PRIO3_Pos      (12U)
#define GPIO_HWCFGR7_AF_PRIO3_Msk      (0xFUL << GPIO_HWCFGR7_AF_PRIO3_Pos)      /*!< 0x0000F000 */
#define GPIO_HWCFGR7_AF_PRIO3          GPIO_HWCFGR7_AF_PRIO3_Msk                /*!< Indicate the priority AF for I/O3 (0 to F) */
#define GPIO_HWCFGR7_AF_PRIO4_Pos      (16U)
#define GPIO_HWCFGR7_AF_PRIO4_Msk      (0xFUL << GPIO_HWCFGR7_AF_PRIO4_Pos)      /*!< 0x000F0000 */
#define GPIO_HWCFGR7_AF_PRIO4          GPIO_HWCFGR7_AF_PRIO4_Msk                /*!< Indicate the priority AF for I/O4 (0 to F) */
#define GPIO_HWCFGR7_AF_PRIO5_Pos      (20U)
#define GPIO_HWCFGR7_AF_PRIO5_Msk      (0xFUL << GPIO_HWCFGR7_AF_PRIO5_Pos)      /*!< 0x00F00000 */
#define GPIO_HWCFGR7_AF_PRIO5          GPIO_HWCFGR7_AF_PRIO5_Msk                /*!< Indicate the priority AF for I/O5 (0 to F) */
#define GPIO_HWCFGR7_AF_PRIO6_Pos      (24U)
#define GPIO_HWCFGR7_AF_PRIO6_Msk      (0xFUL << GPIO_HWCFGR7_AF_PRIO6_Pos)      /*!< 0x0F000000 */
#define GPIO_HWCFGR7_AF_PRIO6          GPIO_HWCFGR7_AF_PRIO6_Msk                /*!< Indicate the priority AF for I/O6 (0 to F) */
#define GPIO_HWCFGR7_AF_PRIO7_Pos      (28U)
#define GPIO_HWCFGR7_AF_PRIO7_Msk      (0xFUL << GPIO_HWCFGR7_AF_PRIO7_Pos)      /*!< 0xF0000000 */
#define GPIO_HWCFGR7_AF_PRIO7          GPIO_HWCFGR7_AF_PRIO7_Msk                /*!< Indicate the priority AF for I/O7 (0 to F) */

/*****************  Bit definition for GPIO_HWCFGR6 register  *****************/
#define GPIO_HWCFGR6_MODER_RES_Pos     (0U)
#define GPIO_HWCFGR6_MODER_RES_Msk     (0xFFFFFFFFUL << GPIO_HWCFGR6_MODER_RES_Pos)  /*!< 0xFFFFFFFF */
#define GPIO_HWCFGR6_MODER_RES         GPIO_HWCFGR6_MODER_RES_Msk               /*!< MODER register reset value */

/*****************  Bit definition for GPIO_HWCFGR5 register  *****************/
#define GPIO_HWCFGR5_PUPDR_RES_Pos     (0U)
#define GPIO_HWCFGR5_PUPDR_RES_Msk     (0xFFFFFFFFUL << GPIO_HWCFGR5_PUPDR_RES_Pos)  /*!< 0xFFFFFFFF */
#define GPIO_HWCFGR5_PUPDR_RES         GPIO_HWCFGR5_PUPDR_RES_Msk               /*!< Pull-up / pull-down register reset value */

/*****************  Bit definition for GPIO_HWCFGR4 register  *****************/
#define GPIO_HWCFGR4_OSPEED_RES_Pos    (0U)
#define GPIO_HWCFGR4_OSPEED_RES_Msk    (0xFFFFFFFFUL << GPIO_HWCFGR4_OSPEED_RES_Pos)   /*!< 0xFFFFFFFF */
#define GPIO_HWCFGR4_OSPEED_RES        GPIO_HWCFGR4_OSPEED_RES_Msk              /*!< OSPEED register reset value */

/*****************  Bit definition for GPIO_HWCFGR3 register  *****************/
#define GPIO_HWCFGR3_ODR_RES_Pos       (0U)
#define GPIO_HWCFGR3_ODR_RES_Msk       (0xFFFFUL << GPIO_HWCFGR3_ODR_RES_Pos)    /*!< 0x0000FFFF */
#define GPIO_HWCFGR3_ODR_RES           GPIO_HWCFGR3_ODR_RES_Msk                 /*!< Output data register reset value */
#define GPIO_HWCFGR3_OTYPER_RES_Pos    (16U)
#define GPIO_HWCFGR3_OTYPER_RES_Msk    (0xFFFFUL << GPIO_HWCFGR3_OTYPER_RES_Pos) /*!< 0xFFFF0000 */
#define GPIO_HWCFGR3_OTYPER_RES        GPIO_HWCFGR3_OTYPER_RES_Msk              /*!< Output type register reset value */

/*****************  Bit definition for GPIO_HWCFGR2 register  *****************/
#define GPIO_HWCFGR2_AFRL_RES_Pos      (0U)
#define GPIO_HWCFGR2_AFRL_RES_Msk      (0xFFFFFFFFUL << GPIO_HWCFGR2_AFRL_RES_Pos) /*!< 0xFFFFFFFF */
#define GPIO_HWCFGR2_AFRL_RES          GPIO_HWCFGR2_AFRL_RES_Msk                /*!< AF register low reset value */

/*****************  Bit definition for GPIO_HWCFGR1 register  *****************/
#define GPIO_HWCFGR1_AFRH_RES_Pos      (0U)
#define GPIO_HWCFGR1_AFRH_RES_Msk      (0xFFFFFFFFUL << GPIO_HWCFGR1_AFRH_RES_Pos) /*!< 0xFFFFFFFF */
#define GPIO_HWCFGR1_AFRH_RES          GPIO_HWCFGR1_AFRH_RES_Msk                /*!< AF register high reset value */

/*****************  Bit definition for GPIO_HWCFGR0 register  *****************/
#define GPIO_HWCFGR0_OR_RES_Pos        (0U)
#define GPIO_HWCFGR0_OR_RES_Msk        (0xFFFFUL << GPIO_HWCFGR0_OR_RES_Pos)     /*!< 0x0000FFFF */
#define GPIO_HWCFGR0_OR_RES            GPIO_HWCFGR0_OR_RES_Msk                  /*!< Option register reset value */

/******************  Bit definition for GPIO_VERR register  *******************/
#define GPIO_VERR_MINREV_Pos           (0U)
#define GPIO_VERR_MINREV_Msk           (0xFUL << GPIO_VERR_MINREV_Pos)           /*!< 0x0000000F */
#define GPIO_VERR_MINREV               GPIO_VERR_MINREV_Msk                     /*!< Minor revision */
#define GPIO_VERR_MAJREV_Pos           (4U)
#define GPIO_VERR_MAJREV_Msk           (0xFUL << GPIO_VERR_MAJREV_Pos)           /*!< 0x000000F0 */
#define GPIO_VERR_MAJREV               GPIO_VERR_MAJREV_Msk                     /*!< Major revision */

/******************  Bit definition for GPIO_IPIDR register  ******************/
#define GPIO_IPIDR_IPID_Pos            (0U)
#define GPIO_IPIDR_IPID_Msk            (0xFFFFFFFFUL << GPIO_IPIDR_IPID_Pos)     /*!< 0xFFFFFFFF */
#define GPIO_IPIDR_IPID                GPIO_IPIDR_IPID_Msk                      /*!< IP identifier */

/******************  Bit definition for GPIO_SIDR register  *******************/
#define GPIO_SIDR_SID_Pos              (0U)
#define GPIO_SIDR_SID_Msk              (0xFFFFFFFFUL << GPIO_SIDR_SID_Pos)       /*!< 0xFFFFFFFF */
#define GPIO_SIDR_SID                  GPIO_SIDR_SID_Msk                        /*!< Size identifier */

/******************************************************************************/
/*                                                                            */
/*                            HW Semaphore (HSEM)                             */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for HSEM_R register  *********************/
#define HSEM_R_PROCID_Pos               (0U)
#define HSEM_R_PROCID_Msk               (0xFFUL << HSEM_R_PROCID_Pos)              /*!< 0x000000FF */
#define HSEM_R_PROCID                   HSEM_R_PROCID_Msk                         /*!< Semaphore PROCID. */
#define HSEM_R_LOCKID_Pos               (8U)
#define HSEM_R_LOCKID_Msk               (0xFUL << HSEM_R_LOCKID_Pos)               /*!< 0x00000F00 */
#define HSEM_R_LOCKID                   HSEM_R_LOCKID_Msk                         /*!< Semaphore LOCKID. */
#define HSEM_R_SEC_Pos                  (12U)
#define HSEM_R_SEC_Msk                  (0x1UL << HSEM_R_SEC_Pos)                  /*!< 0x00001000 */
#define HSEM_R_SEC                      HSEM_R_SEC_Msk                            /*!< Semaphore secure. */
#define HSEM_R_PRIV_Pos                 (13U)
#define HSEM_R_PRIV_Msk                 (0x1UL << HSEM_R_PRIV_Pos)                 /*!< 0x00002000 */
#define HSEM_R_PRIV                     HSEM_R_PRIV_Msk                           /*!< Semaphore privilege. */
#define HSEM_R_CFEN_Pos                 (30U)
#define HSEM_R_CFEN_Msk                 (0x1UL << HSEM_R_CFEN_Pos)                 /*!< 0x40000000 */
#define HSEM_R_CFEN                     HSEM_R_CFEN_Msk                           /*!< Semaphore CID filter indication. */
#define HSEM_R_LOCK_Pos                 (31U)
#define HSEM_R_LOCK_Msk                 (0x1UL << HSEM_R_LOCK_Pos)                 /*!< 0x80000000 */
#define HSEM_R_LOCK                     HSEM_R_LOCK_Msk                           /*!< Lock indication. */

/******************  Bit definition for HSEM_RLR register  ********************/
#define HSEM_RLR_PROCID_Pos             (0U)
#define HSEM_RLR_PROCID_Msk             (0xFFUL << HSEM_RLR_PROCID_Pos)            /*!< 0x000000FF */
#define HSEM_RLR_PROCID                 HSEM_RLR_PROCID_Msk                       /*!< Semaphore PROCID. */
#define HSEM_RLR_LOCKID_Pos             (8U)
#define HSEM_RLR_LOCKID_Msk             (0xFUL << HSEM_RLR_LOCKID_Pos)             /*!< 0x00000F00 */
#define HSEM_RLR_LOCKID                 HSEM_RLR_LOCKID_Msk                       /*!< Semaphore LOCKID. */
#define HSEM_RLR_SEC_Pos                (12U)
#define HSEM_RLR_SEC_Msk                (0x1UL << HSEM_RLR_SEC_Pos)                /*!< 0x00001000 */
#define HSEM_RLR_SEC                    HSEM_RLR_SEC_Msk                          /*!< Semaphore secure. */
#define HSEM_RLR_PRIV_Pos               (13U)
#define HSEM_RLR_PRIV_Msk               (0x1UL << HSEM_RLR_PRIV_Pos)               /*!< 0x00002000 */
#define HSEM_RLR_PRIV                   HSEM_RLR_PRIV_Msk                         /*!< Semaphore privilege. */
#define HSEM_RLR_CFEN_Pos               (30U)
#define HSEM_RLR_CFEN_Msk               (0x1UL << HSEM_RLR_CFEN_Pos)               /*!< 0x40000000 */
#define HSEM_RLR_CFEN                   HSEM_RLR_CFEN_Msk                         /*!< Semaphore CID filter indication. */
#define HSEM_RLR_LOCK_Pos               (31U)
#define HSEM_RLR_LOCK_Msk               (0x1UL << HSEM_RLR_LOCK_Pos)               /*!< 0x80000000 */
#define HSEM_RLR_LOCK                   HSEM_RLR_LOCK_Msk                         /*!< Lock indication. */

/******************  Bit definition for HSEM_C1IER register  ******************/
#define HSEM_C1IER_ISE_Pos              (0U)
#define HSEM_C1IER_ISE_Msk              (0xFFFFUL << HSEM_C1IER_ISE_Pos)           /*!< 0x0000FFFF */
#define HSEM_C1IER_ISE                  HSEM_C1IER_ISE_Msk                        /*!< non-secure Interrupt(n) semaphore x enable bit. (x = 0 to 15) */

#define HSEM_C1IER_ISE0_Pos             (0U)
#define HSEM_C1IER_ISE0_Msk             (0x1UL << HSEM_C1IER_ISE0_Pos)               /*!< 0x00000001 */
#define HSEM_C1IER_ISE0                 HSEM_C1IER_ISE0_Msk                          /*!<semaphore 0 , interrupt 0 enable bit.  */
#define HSEM_C1IER_ISE1_Pos             (1U)
#define HSEM_C1IER_ISE1_Msk             (0x1UL << HSEM_C1IER_ISE1_Pos)               /*!< 0x00000002 */
#define HSEM_C1IER_ISE1                 HSEM_C1IER_ISE1_Msk                          /*!<semaphore 1 , interrupt 0 enable bit.  */
#define HSEM_C1IER_ISE2_Pos             (2U)
#define HSEM_C1IER_ISE2_Msk             (0x1UL << HSEM_C1IER_ISE2_Pos)               /*!< 0x00000004 */
#define HSEM_C1IER_ISE2                 HSEM_C1IER_ISE2_Msk                          /*!<semaphore 2 , interrupt 0 enable bit.  */
#define HSEM_C1IER_ISE3_Pos             (3U)
#define HSEM_C1IER_ISE3_Msk             (0x1UL << HSEM_C1IER_ISE3_Pos)               /*!< 0x00000008 */
#define HSEM_C1IER_ISE3                 HSEM_C1IER_ISE3_Msk                          /*!<semaphore 3 , interrupt 0 enable bit.  */
#define HSEM_C1IER_ISE4_Pos             (4U)
#define HSEM_C1IER_ISE4_Msk             (0x1UL << HSEM_C1IER_ISE4_Pos)               /*!< 0x00000010 */
#define HSEM_C1IER_ISE4                 HSEM_C1IER_ISE4_Msk                          /*!<semaphore 4 , interrupt 0 enable bit.  */
#define HSEM_C1IER_ISE5_Pos             (5U)
#define HSEM_C1IER_ISE5_Msk             (0x1UL << HSEM_C1IER_ISE5_Pos)               /*!< 0x00000020 */
#define HSEM_C1IER_ISE5                 HSEM_C1IER_ISE5_Msk                          /*!<semaphore 5 interrupt 0 enable bit.    */
#define HSEM_C1IER_ISE6_Pos             (6U)
#define HSEM_C1IER_ISE6_Msk             (0x1UL << HSEM_C1IER_ISE6_Pos)               /*!< 0x00000040 */
#define HSEM_C1IER_ISE6                 HSEM_C1IER_ISE6_Msk                          /*!<semaphore 6 interrupt 0 enable bit.    */
#define HSEM_C1IER_ISE7_Pos             (7U)
#define HSEM_C1IER_ISE7_Msk             (0x1UL << HSEM_C1IER_ISE7_Pos)               /*!< 0x00000080 */
#define HSEM_C1IER_ISE7                 HSEM_C1IER_ISE7_Msk                          /*!<semaphore 7 interrupt 0 enable bit.    */
#define HSEM_C1IER_ISE8_Pos             (8U)
#define HSEM_C1IER_ISE8_Msk             (0x1UL << HSEM_C1IER_ISE8_Pos)               /*!< 0x00000100 */
#define HSEM_C1IER_ISE8                 HSEM_C1IER_ISE8_Msk                          /*!<semaphore 8 interrupt 0 enable bit.    */
#define HSEM_C1IER_ISE9_Pos             (9U)
#define HSEM_C1IER_ISE9_Msk             (0x1UL << HSEM_C1IER_ISE9_Pos)               /*!< 0x00000200 */
#define HSEM_C1IER_ISE9                 HSEM_C1IER_ISE9_Msk                          /*!<semaphore 9 interrupt 0 enable bit.    */
#define HSEM_C1IER_ISE10_Pos            (10U)
#define HSEM_C1IER_ISE10_Msk            (0x1UL << HSEM_C1IER_ISE10_Pos)              /*!< 0x00000400 */
#define HSEM_C1IER_ISE10                HSEM_C1IER_ISE10_Msk                         /*!<semaphore 10 interrupt 0 enable bit.   */
#define HSEM_C1IER_ISE11_Pos            (11U)
#define HSEM_C1IER_ISE11_Msk            (0x1UL << HSEM_C1IER_ISE11_Pos)              /*!< 0x00000800 */
#define HSEM_C1IER_ISE11                HSEM_C1IER_ISE11_Msk                         /*!<semaphore 11 interrupt 0 enable bit.   */
#define HSEM_C1IER_ISE12_Pos            (12U)
#define HSEM_C1IER_ISE12_Msk            (0x1UL << HSEM_C1IER_ISE12_Pos)              /*!< 0x00001000 */
#define HSEM_C1IER_ISE12                HSEM_C1IER_ISE12_Msk                         /*!<semaphore 12 interrupt 0 enable bit.   */
#define HSEM_C1IER_ISE13_Pos            (13U)
#define HSEM_C1IER_ISE13_Msk            (0x1UL << HSEM_C1IER_ISE13_Pos)              /*!< 0x00002000 */
#define HSEM_C1IER_ISE13                HSEM_C1IER_ISE13_Msk                         /*!<semaphore 13 interrupt 0 enable bit.   */
#define HSEM_C1IER_ISE14_Pos            (14U)
#define HSEM_C1IER_ISE14_Msk            (0x1UL << HSEM_C1IER_ISE14_Pos)              /*!< 0x00004000 */
#define HSEM_C1IER_ISE14                HSEM_C1IER_ISE14_Msk                         /*!<semaphore 14 interrupt 0 enable bit.   */
#define HSEM_C1IER_ISE15_Pos            (15U)
#define HSEM_C1IER_ISE15_Msk            (0x1UL << HSEM_C1IER_ISE15_Pos)              /*!< 0x00008000 */
#define HSEM_C1IER_ISE15                HSEM_C1IER_ISE15_Msk                         /*!<semaphore 15 interrupt 0 enable bit. */

/******************  Bit definition for HSEM_C1ICR register  ******************/
#define HSEM_C1ICR_ISC_Pos              (0U)
#define HSEM_C1ICR_ISC_Msk              (0xFFFFUL << HSEM_C1ICR_ISC_Pos)           /*!< 0x0000FFFF */
#define HSEM_C1ICR_ISC                  HSEM_C1ICR_ISC_Msk                        /*!< non-secure Interrupt(n) semaphore x clear bit. (x = 0 to 15) */

/******************  Bit definition for HSEM_C1ISR register  ******************/
#define HSEM_C1ISR_ISF_Pos              (0U)
#define HSEM_C1ISR_ISF_Msk              (0xFFFFUL << HSEM_C1ISR_ISF_Pos)           /*!< 0x0000FFFF */
#define HSEM_C1ISR_ISF                  HSEM_C1ISR_ISF_Msk                        /*!< non-secure Interrupt(n) semaphore x status bit before enable (mask). (x = 0 to 15) */

/*****************  Bit definition for HSEM_C1MISR register  ******************/
#define HSEM_C1MISR_MISF_Pos            (0U)
#define HSEM_C1MISR_MISF_Msk            (0xFFFFUL << HSEM_C1MISR_MISF_Pos)         /*!< 0x0000FFFF */
#define HSEM_C1MISR_MISF                HSEM_C1MISR_MISF_Msk                      /*!< masked non-secure interrupt(n) semaphore x status bit after enable (mask). (x = 0 to 15) */

