zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp255cxx_cm0.h
/********************  Bits definition for TAMP_BKP14R register  ***************/
#define TAMP_BKP14R_Pos              (0U)
#define TAMP_BKP14R_Msk              (0xFFFFFFFFUL << TAMP_BKP14R_Pos)                 /*!< 0xFFFFFFFFU */
#define TAMP_BKP14R                  TAMP_BKP14R_Msk

/********************  Bits definition for TAMP_BKP15R register  ***************/
#define TAMP_BKP15R_Pos              (0U)
#define TAMP_BKP15R_Msk              (0xFFFFFFFFUL << TAMP_BKP15R_Pos)                 /*!< 0xFFFFFFFFU */
#define TAMP_BKP15R                  TAMP_BKP15R_Msk

/********************  Bits definition for TAMP_BKP16R register  ***************/
#define TAMP_BKP16R_Pos              (0U)
#define TAMP_BKP16R_Msk              (0xFFFFFFFFUL << TAMP_BKP16R_Pos)                 /*!< 0xFFFFFFFFU */
#define TAMP_BKP16R                  TAMP_BKP16R_Msk

/********************  Bits definition for TAMP_BKP17R register  ***************/
#define TAMP_BKP17R_Pos              (0U)
#define TAMP_BKP17R_Msk              (0xFFFFFFFFUL << TAMP_BKP17R_Pos)                 /*!< 0xFFFFFFFFU */
#define TAMP_BKP17R                  TAMP_BKP17R_Msk

/********************  Bits definition for TAMP_BKP18R register  ***************/
#define TAMP_BKP18R_Pos              (0U)
#define TAMP_BKP18R_Msk              (0xFFFFFFFFUL << TAMP_BKP18R_Pos)                /*!< 0xFFFFFFFFU */
#define TAMP_BKP18R                  TAMP_BKP18R_Msk

/********************  Bits definition for TAMP_BKP19R register  ***************/
#define TAMP_BKP19R_Pos              (0U)
#define TAMP_BKP19R_Msk              (0xFFFFFFFFUL << TAMP_BKP19R_Pos)                /*!< 0xFFFFFFFFU */
#define TAMP_BKP19R                  TAMP_BKP19R_Msk

/********************  Bits definition for TAMP_BKP20R register  ***************/
#define TAMP_BKP20R_Pos              (0U)
#define TAMP_BKP20R_Msk              (0xFFFFFFFFUL << TAMP_BKP20R_Pos)                /*!< 0xFFFFFFFFU */
#define TAMP_BKP20R                  TAMP_BKP20R_Msk

/********************  Bits definition for TAMP_BKP21R register  ***************/
#define TAMP_BKP21R_Pos              (0U)
#define TAMP_BKP21R_Msk              (0xFFFFFFFFUL << TAMP_BKP21R_Pos)                 /*!< 0xFFFFFFFFU */
#define TAMP_BKP21R                  TAMP_BKP21R_Msk

/********************  Bits definition for TAMP_BKP22R register  ***************/
#define TAMP_BKP22R_Pos              (0U)
#define TAMP_BKP22R_Msk              (0xFFFFFFFFUL << TAMP_BKP22R_Pos)                 /*!< 0xFFFFFFFFU */
#define TAMP_BKP22R                  TAMP_BKP22R_Msk

/********************  Bits definition for TAMP_BKP23R register  ***************/
#define TAMP_BKP23R_Pos              (0U)
#define TAMP_BKP23R_Msk              (0xFFFFFFFFUL << TAMP_BKP23R_Pos)                 /*!< 0xFFFFFFFFU */
#define TAMP_BKP23R                  TAMP_BKP23R_Msk

/********************  Bits definition for TAMP_BKP24R register  ***************/
#define TAMP_BKP24R_Pos              (0U)
#define TAMP_BKP24R_Msk              (0xFFFFFFFFUL << TAMP_BKP24R_Pos)                 /*!< 0xFFFFFFFFU */
#define TAMP_BKP24R                  TAMP_BKP24R_Msk

/********************  Bits definition for TAMP_BKP25R register  ***************/
#define TAMP_BKP25R_Pos              (0U)
#define TAMP_BKP25R_Msk              (0xFFFFFFFFUL << TAMP_BKP25R_Pos)                /*!< 0xFFFFFFFFU */
#define TAMP_BKP25R                  TAMP_BKP25R_Msk

/********************  Bits definition for TAMP_BKP26R register  ***************/
#define TAMP_BKP26R_Pos              (0U)
#define TAMP_BKP26R_Msk              (0xFFFFFFFFUL << TAMP_BKP26R_Pos)                /*!< 0xFFFFFFFFU */
#define TAMP_BKP26R                  TAMP_BKP26R_Msk

/********************  Bits definition for TAMP_BKP27R register  ***************/
#define TAMP_BKP27R_Pos              (0U)
#define TAMP_BKP27R_Msk              (0xFFFFFFFFUL << TAMP_BKP27R_Pos)                /*!< 0xFFFFFFFFU */
#define TAMP_BKP27R                  TAMP_BKP27R_Msk

/********************  Bits definition for TAMP_BKP28R register  ***************/
#define TAMP_BKP28R_Pos              (0U)
#define TAMP_BKP28R_Msk              (0xFFFFFFFFUL << TAMP_BKP28R_Pos)                /*!< 0xFFFFFFFFU */
#define TAMP_BKP28R                  TAMP_BKP28R_Msk

/********************  Bits definition for TAMP_BKP29R register  ***************/
#define TAMP_BKP29R_Pos              (0U)
#define TAMP_BKP29R_Msk              (0xFFFFFFFFUL << TAMP_BKP29R_Pos)                /*!< 0xFFFFFFFFU */
#define TAMP_BKP29R                  TAMP_BKP29R_Msk

/********************  Bits definition for TAMP_BKP30R register  ***************/
#define TAMP_BKP30R_Pos              (0U)
#define TAMP_BKP30R_Msk              (0xFFFFFFFFUL << TAMP_BKP30R_Pos)                /*!< 0xFFFFFFFFU */
#define TAMP_BKP30R                  TAMP_BKP30R_Msk

/********************  Bits definition for TAMP_BKP31R register  ***************/
#define TAMP_BKP31R_Pos              (0U)
#define TAMP_BKP31R_Msk              (0xFFFFFFFFUL << TAMP_BKP31R_Pos)                /*!< 0xFFFFFFFFU */
#define TAMP_BKP31R                  TAMP_BKP31R_Msk

/****  Bits definition for TAMP_BKP32R to 128 not added because never user ****/

/********************  Bits definition for TAMP_HWCFGR register  ******************/
#define TAMP_HWCFGR2_OPTIONREG_OUT_Pos  (0U)
#define TAMP_HWCFGR2_OPTIONREG_OUT_Msk  (0xFFUL << TAMP_HWCFGR2_OPTIONREG_OUT_Pos)   /*!< 0x000000FFU */
#define TAMP_HWCFGR2_OPTIONREG_OUT      TAMP_HWCFGR2_OPTIONREG_OUT_Msk
#define TAMP_HWCFGR2_TRUST_ZONE_Pos     (8U)
#define TAMP_HWCFGR2_TRUST_ZONE_Msk     (0xFUL << TAMP_HWCFGR2_TRUST_ZONE_Pos)       /*!< 0x00000F00U */
#define TAMP_HWCFGR2_TRUST_ZONE         TAMP_HWCFGR2_TRUST_ZONE_Msk
#define TAMP_HWCFGR2_RIF_Pos            (12)
#define TAMP_HWCFGR2_RIF_Msk            (0xFUL << TAMP_HWCFGR2_RIF_Pos)              /*!< 0x0000F000U */
#define TAMP_HWCFGR2_RIF                TAMP_HWCFGR2_RIF_Msk

/********************  Bits definition for TAMP_HWCFGR register  ******************/
#define TAMP_HWCFGR1_BACKUP_REGS_Pos    (0U)
#define TAMP_HWCFGR1_BACKUP_REGS_Msk    (0xFFUL << TAMP_HWCFGR1_BACKUP_REGS_Pos)     /*!< 0x000000FFU */
#define TAMP_HWCFGR1_BACKUP_REGS        TAMP_HWCFGR1_BACKUP_REGS_Msk
#define TAMP_HWCFGR1_TAMPER_Pos         (8U)
#define TAMP_HWCFGR1_TAMPER_Msk         (0xFUL << TAMP_HWCFGR1_TAMPER_Pos)           /*!< 0x00000F00U */
#define TAMP_HWCFGR1_TAMPER             TAMP_HWCFGR1_TAMPER_Msk
#define TAMP_HWCFGR1_ACTIVE_TAMPER_Pos  (12U)
#define TAMP_HWCFGR1_ACTIVE_TAMPER_Msk  (0xFUL << TAMP_HWCFGR1_ACTIVE_TAMPER_Pos)    /*!< 0x0000F000U */
#define TAMP_HWCFGR1_ACTIVE_TAMPER      TAMP_HWCFGR1_ACTIVE_TAMPER_Msk
#define TAMP_HWCFGR1_INT_TAMPER_Pos     (8U)
#define TAMP_HWCFGR1_INT_TAMPER_Msk     (0xFUL << TAMP_HWCFGR1_ACTIVE_TAMPER_Pos)    /*!< 0xFFFF0000U */
#define TAMP_HWCFGR1_INT_TAMPER         TAMP_HWCFGR1_ACTIVE_TAMPER_Msk

/*******************  Bits definition for TAMP_VERR register  **************/
#define TAMP_VERR_MINREV_Pos            (0U)
#define TAMP_VERR_MINREV_Msk            (0x4UL << TAMP_VERR_MINREV_Pos)              /*!< 0x0000000F */
#define TAMP_VERR_MINREV                TAMP_VERR_MINREV_Msk                         /*!< TAMP Minor version */
#define TAMP_VERR_MAJREV_Pos            (4U)
#define TAMP_VERR_MAJREV_Msk            (0x4UL << TAMPC_VERR_MAJREV_Pos)             /*!< 0x000000F0 */
#define TAMP_VERR_MAJREV                TAMP_VERR_MAJREV_Msk                         /*!< TAMP Major version */

